In [1]:
import pandas as pd

In [2]:
data = (1, 2), (2, 3), (2,2), (5, 6), (6, 7), (6, 8), (7, 11), (1, 1)

In [3]:
data

((1, 2), (2, 3), (2, 2), (5, 6), (6, 7), (6, 8), (7, 11), (1, 1))

In [28]:
#select number of cluster
k=3

In [29]:
import random
centroid=[]
for x in range(k):
    centroid.append(random.choice(list(data)))

In [30]:
centroid

[(2, 3), (2, 2), (6, 7)]

In [31]:
import math

In [32]:
distance=[]
for c in centroid:
    c_dist=[]
    for row in data:
        dist=math.sqrt((c[0]-row[0])**2+(c[1]-row[1])**2)
        c_dist.append(dist)
    distance.append(c_dist)

In [36]:
xxx=pd.DataFrame(distance)

In [38]:
xxx

,0,1,2,3,4,5,6,7
0,1.414214,0.000000,1.000000,4.242641,5.656854,6.403124,9.433981,2.236068
1,1.000000,1.000000,0.000000,5.000000,6.403124,7.211103,10.295630,1.414214
2,7.071068,5.656854,6.403124,1.414214,0.000000,1.000000,4.123106,7.810250

In [37]:
xxx.min()

0    1.000000
1    0.000000
2    0.000000
3    1.414214
4    0.000000
5    1.000000
6    4.123106
7    1.414214
dtype: float64

In [18]:
new_data=[]
for i in range(len(distance_1)):
    if distance_1[i]<distance_2[i]:
        clus = 1
    else:
        clus = 2
    new_data.append(data[i] + ('clus' + str(clus),))

In [19]:
new_data

[(1, 2, 'clus1'),
 (2, 3, 'clus1'),
 (2, 2, 'clus1'),
 (5, 6, 'clus2'),
 (6, 7, 'clus2'),
 (6, 8, 'clus2'),
 (7, 11, 'clus2'),
 (1, 1, 'clus1')]

In [28]:
import pandas as pd
new_data1=pd.DataFrame(new_data)

In [30]:
new_data1

   0   1      2
0  1   2  clus1
1  2   3  clus1
2  2   2  clus1
3  5   6  clus2
4  6   7  clus2
5  6   8  clus2
6  7  11  clus2
7  1   1  clus1

In [34]:
new_data1.columns=['X_Axis', 'Y_Axis', 'Cluster']

In [37]:
new_data1.groupby('Cluster').mean()

         X_Axis  Y_Axis
Cluster
clus1       1.5     2.0
clus2       6.0     8.0